[
  {
    "id": 1,
    "title": "Oudience.pdf",
    "text": "Oudience – Company Policies & Knowledge Base 1. Company Overview Oudience is a mid-sized technology company focused on AI-powered customer engagement tools. The company operates primarily in the SaaS model and serves clients across e-commerce, finance, education, and healthcare sectors. 2. Office Locations Oudience currently operates from three primary office locations: • Bengaluru, India • Pune, India • Berlin, Germany (remote hub) Most engineering and product roles are based in Bengaluru. 3. Working Hours Policy The standard working hours are from 9:30 AM to 6:30 PM, Monday to Friday. Employees are provided with a flexible arrival window between 9:00 AM and 11:00 AM. Each employee is expected to complete 8 hours of productive work per day, excluding lunch breaks. 4. Remote Work Policy Employees may work remotely for up to 3 days per week, subject to prior approval from their manager. Fully remote roles require a separate contractual agreement and are generally reserved for senior or specialized positions. 5. Leave Policy Oudience provides the following leave entitlements: • 18 days of paid annual leave • 10 public holidays (as per the Indian calendar) • 7 days of paid sick leave annually Unused annual leave can be carried forward up to a maximum of 10 days. 6. Probation Period All new full-time employees are placed on a 3-month probation period. During probation, either party may terminate employment with a 15-day notice. Upon confirmation, the standard notice period increases to 60 days. 7. Notice Period Policy Confirmed employees are required to serve a 60-day notice period. In exceptional cases, notice period buyouts or partial waivers may be approved by the HR Head and reporting manager based on project requirements. 8. Probation Confirmation Process At the end of the probation period, the reporting manager submits a performance evaluation to HR. Based on the"
  },
  {
    "id": 2,
    "title": "Oudience.pdf",
    "text": "or partial waivers may be approved by the HR Head and reporting manager based on project requirements. 8. Probation Confirmation Process At the end of the probation period, the reporting manager submits a performance evaluation to HR. Based on the review: • The employee may be confirmed • The probation may be extended (up to 3 months) • Employment may be terminated 9. Performance Review Cycle Performance reviews are conducted twice a year: • Mid-year review in June • Annual review in December Salary revisions and promotions are typically aligned with the annual review cycle. 10. Expense Reimbursement Policy Employees may claim reimbursements for approved business expenses such as travel, client meetings, and software tools. All claims must be submitted within 30 days of the expense date along with valid receipts. 11. IT Helpdesk Contact Employees can contact the IT Helpdesk via: • Email: it-support@oudience.internal • Service Desk Portal The standard response time for non-critical issues is 24 working hours. 12. Password Policy Employees must use strong passwords containing: • At least 12 characters • Uppercase and lowercase letters • Numbers and special characters Passwords must be updated every 90 days and should not be reused across personal and work accounts. 13. VPN Usage Policy Remote employees must connect to the corporate VPN before accessing internal tools, repositories, or databases. VPN credentials are strictly personal and must not be shared. 14. Data Classification Levels Oudience follows four levels of data classification: 1. Public 2. Internal 3. Confidential 4. Highly Confidential Customer data and production database dumps are always considered Highly Confidential. 15. Customer Support Working Hours Customer support operations run from 9:00 AM to 9:00 PM IST, Monday to Saturday. P1 critical incidents are handled 24×7 through an on-call rotation. 16. Support Response SLAs Service Level Agreements (SLAs) for paid"
  },
  {
    "id": 3,
    "title": "Oudience.pdf",
    "text": "Confidential. 15. Customer Support Working Hours Customer support operations run from 9:00 AM to 9:00 PM IST, Monday to Saturday. P1 critical incidents are handled 24×7 through an on-call rotation. 16. Support Response SLAs Service Level Agreements (SLAs) for paid customers: • P1: 30 minutes • P2: 2 hours • P3: 8 business hours • P4: 2 business days 17. Product Tiers Oudience offers three subscription tiers: • Starter – For small teams • Growth – Includes automation workflows and analytics • Enterprise – Includes SSO, advanced security, and custom integrations 18. Supported Languages in Chatbot The chatbot supports English by default. Enterprise customers can enable additional languages such as Hindi, Spanish, French, and German via the admin console. 19. Chatbot Analytics Features The analytics module provides insights such as: • Total conversations • Resolution rate • Average response time • User satisfaction score • Fallback rate Data can be filtered by date range, channel, and customer segment. 20. Security Certifications Oudience follows industry best practices for security and is aligning with ISO 27001 standards. Enterprise customers may request additional security documentation or DPAs. 21. Email Etiquette Guidelines Internal emails should be professional, concise, and respectful. Sensitive topics such as performance issues should be addressed via meetings or HR channels instead of email. 22. Code Review Policy All production code changes must go through at least one peer review via a pull request. High-risk changes require approval from a senior engineer or tech lead. 23. Release Management Process Releases are generally performed twice a week during low-traffic periods. Each release must include a rollback plan and approval from the release manager. 24. Incident Management Process For major incidents: • On-call engineer must acknowledge within 15 minutes • Incident channel must be updated • Mitigation must begin immediately • A post-incident"
  },
  {
    "id": 4,
    "title": "Oudience.pdf",
    "text": "must include a rollback plan and approval from the release manager. 24. Incident Management Process For major incidents: • On-call engineer must acknowledge within 15 minutes • Incident channel must be updated • Mitigation must begin immediately • A post-incident report is required within 48 hours 25. Internship Stipend Policy Technical interns receive a fixed monthly stipend. The exact amount depends on location, duration, and skill level, and is specified in the offer letter. 26. HR Contact Details HR-related queries can be sent to hr@oudience.internal. Typical response time is 2–3 business days. 27. Onboarding Checklist New employees receive: • Company laptop • Official email account • Access to internal tools Mandatory training on security awareness and code of conduct must be completed within the first week. 28. Offboarding Checklist Employees must: • Return company assets • Revoke system access • Hand over responsibilities • Complete an exit interview with HR 29. Supported Chatbot Channels The chatbot can be deployed on: • Web widgets • WhatsApp • Facebook Messenger • Slack API access is available for custom integrations. 30. Data Retention Policy Chat logs for paying customers are retained for 12 months by default. Custom retention periods can be negotiated. 31. API Rate Limits Default API limits: • Starter: 1000 requests/min • Growth: 5000 requests/min • Enterprise: Custom limits based on contract 32. Backup Policy Production databases are backed up every 4 hours with 30-day retention. Backups are encrypted and stored in a separate region. 33. Supported Browsers The web console supports the latest two versions of: • Chrome • Edge • Firefox Limited support is available for Safari and mobile browsers. 34. Customer Onboarding Process Customer onboarding includes: 1. Environment setup 2. Integration configuration 3. Chatbot training using FAQs or documents 35. Payment Terms Invoices are typically issued annually in"
  },
  {
    "id": 5,
    "title": "Oudience.pdf",
    "text": "• Firefox Limited support is available for Safari and mobile browsers. 34. Customer Onboarding Process Customer onboarding includes: 1. Environment setup 2. Integration configuration 3. Chatbot training using FAQs or documents 35. Payment Terms Invoices are typically issued annually in advance with a 30-day payment term. Custom payment schedules may be negotiated. 36. Trial Account Limitations Trial accounts: • Are valid for 14 days • Have usage and integration limits • May have data deleted after expiration 37. Logging and Monitoring Logs, metrics, and traces are collected using a centralized monitoring stack. Engineers track performance via dashboards. 38. Hardware Requirements for On-Prem Deployment Recommended minimum hardware: • 8 CPU cores • 32 GB RAM • SSD storage Requirements may increase based on traffic. 39. Training Data Guidelines Customers should not upload sensitive data such as: • Passwords • Financial information • Personally identifiable information Unless a data protection agreement is in place. 40. Bug Reporting Process Bugs can be reported via: • Support portal • Web console “Report an Issue” feature Each bug is assigned a tracking ID and priority. 41. Extracted PDF Knowledge (Oudience_Test_Knowledge_Base.pdf) The uploaded PDF contains consolidated information on: • Company overview • Working hours • Remote work policy • Leave policy • IT support • Data security guidelines This content has been successfully integrated into the chatbot knowledge base."
  },
  {
    "id": 6,
    "title": "Oudience_updated_.pdf",
    "text": "1. Workplace Culture Our Culture Statement We believe in creating a respectful, inclusive, and growth-oriented workplace where everyone feels valued, heard, and empowered to do their best work. Core Values • Respect – Treat everyone with dignity and fairness. • Integrity – Be honest, ethical, and accountable. • Collaboration – Work together and support each other. • Professionalism – Maintain high standards in behavior and communication. • Continuous Learning – Encourage innovation and personal growth. Work Ethic • Be punctual and dependable. • Take ownership of responsibilities. • Focus on quality, not just speed. • Maintain confidentiality and trust. Communication Culture • Communicate clearly, respectfully, and constructively. • Listen actively and value diverse opinions. • Address concerns professionally and through proper channels. Inclusivity & Diversity • Respect cultural, social, and individual differences. • Zero tolerance for discrimination, harassment, or bullying. • Promote equal opportunities for all. 2. Workplace Do’s ✔ Professional Conduct • Dress appropriately as per company guidelines. • Maintain a polite and respectful tone. • Follow organizational policies and procedures. ✔ Teamwork • Support colleagues and collaborate effectively. • Share knowledge and help others grow. • Give credit where it is due. ✔ Responsibility • Meet deadlines and commitments. • Inform supervisors in case of delays or issues. • Use company resources responsibly. ✔ Ethics & Integrity • Be honest in all professional dealings. • Protect confidential information. • Report unethical behavior through proper channels. ✔ Health & Safety • Follow safety rules and emergency procedures. • Maintain a clean and safe workspace. • Report hazards or unsafe conditions immediately. 3. Workplace Don’ts ✖ Behavior & Conduct • Do not engage in harassment, bullying, or discrimination. • Avoid abusive language or inappropriate jokes. • Do not create a hostile or uncomfortable environment. ✖ Professionalism • Do not misuse"
  },
  {
    "id": 7,
    "title": "Oudience_updated_.pdf",
    "text": "conditions immediately. 3. Workplace Don’ts ✖ Behavior & Conduct • Do not engage in harassment, bullying, or discrimination. • Avoid abusive language or inappropriate jokes. • Do not create a hostile or uncomfortable environment. ✖ Professionalism • Do not misuse company property or data. • Avoid gossiping or spreading rumors. • Do not use office time for personal work excessively. ✖ Communication • Do not interrupt or disrespect others during discussions. • Avoid aggressive or unprofessional emails/messages. • Do not bypass reporting hierarchies unnecessarily. ✖ Ethics Violations • Do not accept or offer bribes or favors. • Avoid conflicts of interest. • Do not falsify records or information. 4. Digital & Remote Work Etiquette (If Applicable) Do’s • Be responsive during work hours. • Maintain professionalism in virtual meetings. • Secure company data and devices. Don’ts • Do not share passwords or confidential files. • Avoid unprofessional backgrounds or behavior in meetings. • Do not ignore official communication channels. 5. Acknowledgement All employees are expected to understand, respect, and follow this workplace culture and code of conduct to maintain a positive and productive environment. Employee Name: ____________________ Signature: ________________________ Date: _____________________________"
  }
]